In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('G:\IT\SMT 6\Data Mining\gitub\DATA-MINING_4619\DATA-MINING_4619\Assignment-2\Data.csv')
df.head(10)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [3]:
X = df.loc[:, ['Country','Age','Salary', 'Purchased']]
y = df['Purchased']

In [4]:
X.head(10)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
y.head(10)

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [6]:
# subset all categorical variables
country_categorical = X.select_dtypes(include=['object'])
# convert into dummies
country_dummies = pd.get_dummies(country_categorical, drop_first=True)
# drop categorical variables 
X = X.drop(list(country_categorical.columns), axis=1)
# concat dummy variables with X
X = pd.concat([X, country_dummies], axis=1)

In [7]:
from sklearn.preprocessing import scale
cols = X.columns
X = pd.DataFrame(scale(X))
X.columns = cols
X.columns

Index(['Age', 'Salary', 'Country_Germany', 'Country_Spain', 'Purchased_Yes'], dtype='object')

In [8]:
# split into train and test
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.7, test_size = 0.3, random_state=100)

In [9]:
X

        Age    Salary  Country_Germany  Country_Spain  Purchased_Yes
0  0.719931  0.711013        -0.654654      -0.654654           -1.0
1 -1.623675 -1.364376        -0.654654       1.527525            1.0
2 -1.210098 -0.845529         1.527525      -0.654654           -1.0
3 -0.107224 -0.240207        -0.654654       1.527525           -1.0
4  0.168495       NaN         1.527525      -0.654654            1.0
5 -0.520801 -0.499631        -0.654654      -0.654654            1.0
6       NaN -1.018478        -0.654654       1.527525           -1.0
7  1.271368  1.316334        -0.654654      -0.654654            1.0
8  1.547087  1.662233         1.527525      -0.654654           -1.0
9 -0.245083  0.278640        -0.654654      -0.654654            1.0

In [10]:
y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object